# mason_gre_1000
p.1

sanguine
specious
forestall
esoteric
paucity

# mason_gre_1000
p.2

confound
belie
pragmatic
thwart
repudiate
sporadic
taciturn

# mason_gre_1000
p.3

perfunctory
contentious
mundane
polemical
inimical

# mason_gre_1000
p.4

orthodox
obfuscate
conjecture
scrutinize
trepidation
fastidious
ostensible
idiosyncratic

# mason_gre_1000
p.5

partisan
veritable
arcane
paradigm
sarcastic

# mason_gre_1000
p.6

vitiate
garrulous
loathe
whimsical
zealous
deft
reciprocity

# mason_gre_1000
p.7

solicit
preempt
insular
precarious
pugnacious
corroborate
transcendent

# mason_gre_1000
p.8

obviate
analogous
lugubrious (lu-gu-bri-ous)
lurid
torpor
truculent

# mason_gre_1000
p.9

ubiquitous
articulate
reconcile
excoriate
germane
transitory

# mason_gre_1000
p.10

loquacious
mediocre
nuance
disparage
immpartial
perpetuate
rigid
condescending
inconsequential

# mason_gre_1000
p.11

portend
transient
bolster
fathom
flout
hackneyed
lethargic
shun
spurious

# mason_gre_1000
p.12

vacillate
exigent
precedent
precursor
factitious
deference
peripheral
diffuse
congenial

# mason_gre_1000
p.13

pedestrian
impetuous
complacent
inexplicable
derivative
conscientious

# mason_gre_1000
p.14

ecstatic
insolent
inadvertent
viable
buoyant
empiricism
exuberant
fickle
inhibit
intelligible
loath
opprobrium

# mason_gre_1000
p.15

rancor
veneration
inept
exacting
antagonistic
embellish
recapitulate
captious

# mason_gre_1000
p.16

exacavate
censorious
feckless
grandiose
incongruous
emulate
judicious
mendacious

# mason_gre_1000
p.17

abnegate
expedient
compelling
duplicity
salutary
schism
insipid
abstemious

# mason_gre_1000
p.18

intractable
evanescent
vapid
virtuosity
astute
austere
avarice
bland
calamity

# mason_gre_1000
p.19

downplay
ebb
extraneous
forbear
formidable
lionize
lament
indulgent
oblivious

# mason_gre_1000
p.20

quixotic
stymie
unctuous
callous
clandestine
conciliatory
aristocrat
discrepancy
discrete
discretion

p.21

culprit
condone
adroit
multifaceted
fidelity
discomfit
congruent
imperative
l
p.22

allusive             alluring | allusive         eval "$(pyenv init --path)"
delude
demur
negate
ossify
impeccable
pejorative
euphemism

p.23

apposite
irascible
salient
prescient
proscribe
obsequious                  p.20 unctuous = obsequious
obsolete
obstinate

p.24

presumptuous
stigma
pertain
epitome
treacherous
vindicate
aversion
abet

p.25

arduous
debunk
feign
flair
forage
furtive          clandestine, foxy
futile           fruitless, useless
hubris           pride and prejudice -> hurbris, overconfidence

p.26

plaintive        mournful, doleful, melancholy
rebuff           reject
redeem
revere
sabotage
savor
scruple
reactionary
unanimous

p.27

hyperbole
supercilious
precipitate
clairvoyance
irreconcilable
credulous
succumb
subdue

p.28

egalitarian
facile
fervent
gratify
exhilarate
humility
prolix
lackluster

p.29

communal
exonerate
synopsis
ornamental
parody
peripatetic
penchant
placid

p.30

proprietary
repugnant
quiescent
tranquil
riveting
surrogate
sacrosanct
prescription

p.31

supersede
dissipate
somnolent
soporific
aspersion
outstrip
resurge
tenacious
intransigent

p.32

vacuous
verisimilitude
subvert
revile
convoluted
promulgate
at odds
caterwaul


p.33

coerce
cogent
dabble
decry
edify
encomium
espouse
extol
fortuitous

p.34

irenic
latent
rarified
scathing
shrewd
spurn
trifling
tyranny

p.35

wane
protagonist
adept
exasperate
ingratiate
demeanor
agitated
peregrinate

p.36

enamored
animadvert
animosity
perennial
asteroid
avid
banish
base
beneficent

p.37

blithe
recalcitrant
incessant
unprecedented
susceptible
exorcise
insouciance
proclivity

p.38

incubate
covet
discourse
decorum
endemic
dubious
duplicity
indolent

p.39

conducive
inert
quintessential
pitfall
forfeit
infelicitous
munificent
figurative

p.40

conflate
fractious
refractory
suffrage
effrontery
fulminate
founder
effusive
degenerate

p.41

indigenous
ingrain
hortative
disjunctive
abjure
conjure
jubilation
rejuvenate

p.42

allegiance
apologist
eloquence
disillusioned
malady
malevolent
premeditate
mire
unremitting

p.43

moderate
mordant
tantamount
negligent
negligible
pernicious
normative
ominous ->-<- auspicious

p.44

opulent
inexorable
compendium
pensive
impetus
ephemeral
aphorism
metaphor

p.45

piety
duplicitous
extrapolate
ponderous
opportune
purport
posit
potent

p.46

probity
apropos
appropriate
propriety
prosaic
impugn
compunction
punctilious
rapacious
rectitude














